#### ElementMulticategoryFilter Members

---

|  |
| --- |
| ElementMulticategoryFilter Class   Constructors   Methods   Properties   See Also |

The  ElementMulticategoryFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementMulticategoryFilter(ICollection BuiltInCategory ) | Constructs a new instance of a filter to match elements by built-in category. |
| Public method | ElementMulticategoryFilter(ICollection ElementId ) | Constructs a new instance of a filter to find elements whose category matches any of a given set of categories. |
| Public method | ElementMulticategoryFilter(ICollection BuiltInCategory , Boolean) | Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category. |
| Public method | ElementMulticategoryFilter(ICollection ElementId , Boolean) | Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to instead match elements which are not of the given categories. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ElementFilter  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCategoryIds | Gets the category ids assigned to this filter. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | PassesFilter(Element) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from  ElementFilter  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ElementFilter  .) |

# See Also

ElementMulticategoryFilter Class

Autodesk.Revit.DB Namespace